# BIG DATA ANALYSIS: Data 전처리
데이터셋 설명: [타이타닉](https://www.kaggle.com/c/titanic/overview)
---

## 1. 데이터셋 로딩

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/train.csv")

In [3]:
df

,아이디,생존,객실등급,이름,성별,나이,형제자매,부모,티켓번호,요금,객실번호,승선항
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 2. 무의미한 컬럼제거 (Feature Selection)

In [4]:
df = df.drop(['아이디', '티켓번호'], axis=1)
df

,생존,객실등급,이름,성별,나이,형제자매,부모,요금,객실번호,승선항
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q

## 3. 결측값 처리

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   생존      891 non-null    int64
 1   객실등급    891 non-null    int64
 2   이름      891 non-null    object
 3   성별      891 non-null    object
 4   나이      714 non-null    float64
 5   형제자매    891 non-null    int64
 6   부모      891 non-null    int64
 7   요금      891 non-null    float64
 8   객실번호    204 non-null    object
 9   승선항     889 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [6]:
#객실번호는 결측값이 많으므로, 컬럼 자체를 버리기
df = df.drop(['객실번호'], axis=1)

In [7]:
#승선한은 결측값이 2개밖에 되지 않으므로, 두 객체를 버리기
df = df.dropna(subset = ["승선항"])
df

,생존,객실등급,이름,성별,나이,형제자매,부모,요금,승선항
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,Q

In [8]:
print("생존: ",df['생존'].isnull().sum())
print("객실등급: ", df['객실등급'].isnull().sum())
print("이름: ", df['이름'].isnull().sum())
print("나이: ",df['나이'].isnull().sum())
print("형제자매: ",df['형제자매'].isnull().sum())
print("부모: ",df['부모'].isnull().sum())
print("요금: ",df['요금'].isnull().sum())
print("승선항: ",df['승선항'].isnull().sum())

생존:  0
객실등급:  0
이름:  0
나이:  177
형제자매:  0
부모:  0
요금:  0
승선항:  0

In [9]:
#Option1: 전체 나이의 평균으로 대입
avg = df['나이'].mean()
print(avg)
df['나이'].fillna(avg)

29.64209269662921

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.642093
889    26.000000
890    32.000000
Name: 나이, Length: 889, dtype: float64

In [10]:
# option2. 남녀 각각의 나이
male_avg = df[df['성별']=="male"]['나이'].mean() 
female_avg = df[df['성별']=="female"]['나이'].mean() 
print(male_avg, female_avg)
mask = df['성별']=="female"
df.loc[mask,'나이'] = df.loc[mask,'나이'].fillna(female_avg)
mask = df['성별']=="male"
df.loc[mask,'나이'] = df.loc[mask,'나이'].fillna(male_avg)

30.72664459161148 27.745173745173744

In [11]:
df

,생존,객실등급,이름,성별,나이,형제자매,부모,요금,승선항
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.745174,1,2,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,7.7500,Q

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   생존      889 non-null    int64
 1   객실등급    889 non-null    int64
 2   이름      889 non-null    object
 3   성별      889 non-null    object
 4   나이      889 non-null    float64
 5   형제자매    889 non-null    int64
 6   부모      889 non-null    int64
 7   요금      889 non-null    float64
 8   승선항     889 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 69.5+ KB

In [13]:
#option3 Mr, Miss, 부모, 형제자매 수 등으로 더 디테일한 나이를 예측 할 수 있지 않을까?

# 4. 정규화

In [14]:
def minmax(min_val, max_val, val):
    return (val-min_val)/(max_val-min_val)

In [15]:
#Test

In [16]:
from sklearn.preprocessing import MinMaxScaler

In [17]:
scaler = MinMaxScaler()
numerics = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']

newdf = df.select_dtypes(include=numerics)

scaled_age = scaler.fit_transform(newdf)

organized_df = pd.DataFrame(scaled_age, columns=newdf.columns, index=list(newdf.index.values))
organized_df.head()

    생존  객실등급        나이   형제자매   부모        요금
0  0.0   1.0  0.271174  0.125  0.0  0.014151
1  1.0   0.0  0.472229  0.125  0.0  0.139136
2  1.0   1.0  0.321438  0.000  0.0  0.015469
3  1.0   0.0  0.434531  0.125  0.0  0.103644
4  0.0   1.0  0.434531  0.000  0.0  0.015713

# 5. 인코딩

In [18]:
df

,생존,객실등급,이름,성별,나이,형제자매,부모,요금,승선항
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.745174,1,2,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,7.7500,Q

In [19]:
organized_df

      생존  객실등급        나이   형제자매        부모        요금
0    0.0   1.0  0.271174  0.125  0.000000  0.014151
1    1.0   0.0  0.472229  0.125  0.000000  0.139136
2    1.0   1.0  0.321438  0.000  0.000000  0.015469
3    1.0   0.0  0.434531  0.125  0.000000  0.103644
4    0.0   1.0  0.434531  0.000  0.000000  0.015713
..   ...   ...       ...    ...       ...       ...
886  0.0   0.5  0.334004  0.000  0.000000  0.025374
887  1.0   0.0  0.233476  0.000  0.000000  0.058556
888  0.0   1.0  0.343367  0.125  0.333333  0.045771
889  1.0   0.0  0.321438  0.000  0.000000  0.058556
890  0.0   1.0  0.396833  0.000  0.000000  0.015127

[889 rows x 6 columns]

In [20]:
organized_df['성별_b'] = df['성별'].factorize()[0]

In [21]:
organized_df

      생존  객실등급        나이   형제자매        부모        요금  성별_b
0    0.0   1.0  0.271174  0.125  0.000000  0.014151     0
1    1.0   0.0  0.472229  0.125  0.000000  0.139136     1
2    1.0   1.0  0.321438  0.000  0.000000  0.015469     1
3    1.0   0.0  0.434531  0.125  0.000000  0.103644     1
4    0.0   1.0  0.434531  0.000  0.000000  0.015713     0
..   ...   ...       ...    ...       ...       ...   ...
886  0.0   0.5  0.334004  0.000  0.000000  0.025374     0
887  1.0   0.0  0.233476  0.000  0.000000  0.058556     1
888  0.0   1.0  0.343367  0.125  0.333333  0.045771     1
889  1.0   0.0  0.321438  0.000  0.000000  0.058556     0
890  0.0   1.0  0.396833  0.000  0.000000  0.015127     0

[889 rows x 7 columns]

In [22]:
from sklearn.preprocessing import OneHotEncoder

In [23]:
encoder = OneHotEncoder()
val, categories = df['승선항'].factorize()
one_hot = encoder.fit_transform(val.reshape(-1, 1))
one_hot.toarray()

array([[1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       ...,
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [24]:
categories

Index(['S', 'C', 'Q'], dtype='object')

In [25]:
organized_df['승선항_S'] = one_hot.toarray()[:,0]
organized_df['승선항_C'] = one_hot.toarray()[:,1]
organized_df['승선항_Q'] = one_hot.toarray()[:,2]

In [26]:
organized_df

      생존  객실등급        나이   형제자매        부모        요금  성별_b  승선항_S  승선항_C  승선항_Q
0    0.0   1.0  0.271174  0.125  0.000000  0.014151     0    1.0    0.0    0.0
1    1.0   0.0  0.472229  0.125  0.000000  0.139136     1    0.0    1.0    0.0
2    1.0   1.0  0.321438  0.000  0.000000  0.015469     1    1.0    0.0    0.0
3    1.0   0.0  0.434531  0.125  0.000000  0.103644     1    1.0    0.0    0.0
4    0.0   1.0  0.434531  0.000  0.000000  0.015713     0    1.0    0.0    0.0
..   ...   ...       ...    ...       ...       ...   ...    ...    ...    ...
886  0.0   0.5  0.334004  0.000  0.000000  0.025374     0    1.0    0.0    0.0
887  1.0   0.0  0.233476  0.000  0.000000  0.058556     1    1.0    0.0    0.0
888  0.0   1.0  0.343367  0.125  0.333333  0.045771     1    1.0    0.0    0.0
889  1.0   0.0  0.321438  0.000  0.000000  0.058556     0    0.0    1.0    0.0
890  0.0   1.0  0.396833  0.000  0.000000  0.015127     0    0.0    0.0    1.0

[889 rows x 10 columns]